minishell> a|b
content: a attr: 0
content: | attr: 2
content: b attr: 0
minishell> minishell> a>b
content: a attr: 0
content: > attr: 4
content: b attr: 0
minishell> minishell> a<b
content: a attr: 0
content: < attr: 3
content: b attr: 0
minishell> minishell> a>>b
content: a attr: 0
content: >> attr: 6
content: b attr: 0
minishell> minishell> a<<b
content: a attr: 0
content: << attr: 5
content: b attr: 0
minishell> 